TesboCFD/modules/visualization/tutorials/lagrangian/coalChemistryFoam/simplifiedSiwek/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1.0;

vertices
(
    (0     0     0)
    (0.05  0     0)
    (0.05  0.5   0)
    (0     0.5   0)
    (0     0     0.1)
    (0.05  0     0.1)
    (0.05  0.5   0.1)
    (0     0.5   0.1)
    (0.5   0     0)
    (0.5   0.5   0)
    (0.5   0     0.1)
    (0.5   0.5   0.1)
    (0.05  1     0)
    (0     1     0)
    (0.05  1     0.1)
    (0     1     0.1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7)     (5 50 1) simpleGrading (1 1 1)
    hex (1 8 9 2 5 10 11 6)   (40 50 1) simpleGrading (1 1 1)
    hex (3 2 12 13 7 6 14 15) (5 50 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    top
    {
        type wall;
        faces
        (
            (13 15 14 12)
        );
    }
    bottom
    {
        type wall;
        faces
        (
            (0 1 5 4)
            (1 8 10 5)
        );
    }
    walls
    {
        type wall;
        faces
        (
            (8 9 11 10)
            (9 2 6 11)
            (2 12 14 6)
        );
    }
    symmetry
    {
        type symmetryPlane;
        faces
        (
            (4 7 3 0)
            (7 15 13 3)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (3 13 12 2)
            (1 2 9 8)
            (5 6 7 4)
            (6 14 15 7)
            (10 11 6 5)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
